### <a name='0'></a>Import biblioteki

In [3]:
import numpy as np
import pandas as pd

pd.__version__

'2.3.3'

### <a name='1'></a> Ćwiczenie 1
Z podanej poniżej listy:


```
stocks = ['PLW', 'CDR', '11B', 'TEN']
```
Utwórz obiekt typu Series.

__Oczekiwany wynik:__


```
0    PLW
1    CDR
2    11B
3    TEN
dtype: object
```

In [4]:
stocks = ['PLW', 'CDR', '11B', 'TEN']

In [6]:
pd.Series(data=stocks)

0    PLW
1    CDR
2    11B
3    TEN
dtype: object

### <a name='2'></a> Ćwiczenie 2
Z podanego poniżej słownika:


```
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
```
Utwórz obiekt typu Series i przypisz do zmiennej _quotations_.

__Oczekiwany wynik:__


```
PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64
```

In [7]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}

In [8]:
quotations = pd.Series(data=stocks)
quotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

### <a name='3'></a> Ćwiczenie 3
Przekształć obiekt _quotations_ do listy.

__Oczekiwany wynik:__


```
[387.0, 339.5, 349.5, 391.0]
```

In [9]:
quotations.to_list()

[387.0, 339.5, 349.5, 391.0]

Przekształć obiekt _quotations_ do tablicy _numpy_.

In [11]:
quotations.to_numpy()

array([387. , 339.5, 349.5, 391. ])

In [13]:
quotations.values

array([387. , 339.5, 349.5, 391. ])

### <a name='4'></a> Ćwiczenie 4
Przekształć obiekt _quotations_ do obiektu _DataFrame_. Ustaw nazwę kolumny na _price_.

In [14]:
pd.DataFrame(quotations, columns=['price'])

     price
PLW  387.0
CDR  339.5
TEN  349.5
11B  391.0

### <a name='5'></a> Ćwiczenie 5
Wykorzystując bibliotekę _numpy_ zbuduj poniższy obiekt typu _Series_:


```
101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64
```

In [15]:
pd.Series(data=np.arange(10, 100, 10), index=np.arange(101, 110), dtype='float')

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64

### <a name='6'></a> Ćwiczenie 6
Podany jest poniższy obiekt typu _Series_:

```
series = pd.Series(['001', '002', '003', '004'], list('abcd'))
```
Skonwertuj typ obiektu _series_ na _int_.

In [16]:
series = pd.Series(['001', '002', '003', '004'], list('abcd'))

In [17]:
series

a    001
b    002
c    003
d    004
dtype: object

In [ ]:
series.astype(int)

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
pd.to_numeric(series)

a    1
b    2
c    3
d    4
dtype: int64

Skonwertuj typ obiektu _series_ na _float_.

In [20]:
series.astype(float)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [24]:
series

a    001
b    002
c    003
d    004
dtype: object

In [23]:
series.apply(len)

a    3
b    3
c    3
d    3
dtype: int64

In [47]:
import pandas as pd
s = pd.Series(['001', '002', '003', '004'], list('abcd'))
s

a    001
b    002
c    003
d    004
dtype: object

In [26]:
s_float = s.astype(float)

In [27]:
s_float

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [28]:
s = s.astype(float)
s

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [29]:
s_float = pd.to_numeric(s)
s_float

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [32]:
s

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [52]:
s = pd.Series(['A01', 'B02', 'C03', 'D04'], list('abcd'))
s

a    A01
b    B02
c    C03
d    D04
dtype: object

In [53]:
s.apply(lambda x: x[-1]).astype(float)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

### <a name='7'></a> Ćwiczenie 7
Do poniższego obiektu _quotations_:

```
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)
```
Dodaj dwa elementy:
* indeks: BBT, wartość: 25.5
* indeks: F51, wartość: 19.2

__Oczekiwany wynik:__


```
PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64
```

__Wskazówka:__ Użyj funkcji _pd.concat()._

In [54]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)

In [57]:
quotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

In [55]:
pd.concat([quotations, pd.Series({'BBT': 25.5, 'F51': 19.2})])

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64

### <a name='8'></a> Ćwiczenie 8
Obiekt _quotations_ z poprzedniego ćwiczenia przekształć do obiektu typu _DataFrame_. Zresetuj indeks i nadaj nazwy kolumn '_ticker_' oraz _'price'_.

__Wskazówka:__ Użyj funkcji _pd.reset_index()._

In [58]:
quotations = pd.DataFrame(quotations).reset_index()
quotations.columns = ['ticker', 'price']
quotations

  ticker  price
0    PLW  387.0
1    CDR  339.5
2    TEN  349.5
3    11B  391.0

### <a name='9'></a> Ćwiczenie 9
Zbuduj poniższy obiekt _DataFrame_ i przypisz do zmiennej _companies_:

|    | company   |   price | ticker   |
|---:|:----------|--------:|:---------|
|  0 | Amazon    |  2375   | AMZN.US  |
|  1 | Microsoft |   178.6 | MSFT.US  |
|  2 | Facebook  |   179.2 | FB.US    |

In [59]:
data_dict = {
    'company': ['Amazon', 'Microsoft', 'Facebook'],
    'price': [2375.00, 178.6, 179.2],
    'ticker': ['AMZN.US', 'MSFT.US', 'FB.US']
}

companies = pd.DataFrame(data=data_dict)
companies

     company   price   ticker
0     Amazon  2375.0  AMZN.US
1  Microsoft   178.6  MSFT.US
2   Facebook   179.2    FB.US

### <a name='10'></a> Ćwiczenie 10
Przekształć pierwszą kolumnę obiektu _companies_ w indeks.

__Wskazówka:__ Użyj funkcji _pd.set_index()._

In [60]:
companies = companies.set_index('company')
companies

            price   ticker
company
Amazon     2375.0  AMZN.US
Microsoft   178.6  MSFT.US
Facebook    179.2    FB.US

Wytnij wiersz dla spółki _Facebook_ z obiektu _companies_.

In [63]:
companies.loc['Facebook']

price     179.2
ticker    FB.US
Name: Facebook, dtype: object

In [64]:
companies.iloc[2]

price     179.2
ticker    FB.US
Name: Facebook, dtype: object

Wytnij cenę dla spółki _Microsoft_

In [65]:
companies.loc['Microsoft', 'price']

np.float64(178.6)

In [ ]:
companies.iloc[1, 0] # iteracja

np.float64(178.6)